app/Controllers/Admin/BarangMasukController.php

SELECT `tbl_barang_masuk`.*, `tbl_pesanan`.*, `tbl_supplier`.`nama_supplier`
FROM `tbl_barang_masuk`
JOIN `tbl_pesanan` ON `tbl_barang_masuk`.`id_pesanan` = `tbl_pesanan`.`id_pesanan`
JOIN `tbl_supplier` ON `tbl_pesanan`.`id_supplier` = `tbl_supplier`.`id_supplier`
---
    public function index()
    {

        $data = [
            'title' => 'Barang Masuk',
            'barang_masuk' => $this->barangMasukModel
                ->select('tbl_barang_masuk.*, tbl_pesanan.*, tbl_supplier.nama_supplier') // Pilih kolom yang dibutuhkan
                ->join('tbl_pesanan', 'tbl_barang_masuk.id_pesanan = tbl_pesanan.id_pesanan') // Join dengan tbl_pesanan
                ->join('tbl_supplier', 'tbl_pesanan.id_supplier = tbl_supplier.id_supplier') // Join dengan tabel supplier
                ->findAll()