app/Controllers/Admin/BarangKeluarController.php

SELECT `tbl_barang_keluar`.*, `tbl_penjualan`.*, `tbl_barang`.`nama_barang`
FROM `tbl_barang_keluar`
JOIN `tbl_penjualan` ON `tbl_barang_keluar`.`id_penjualan` = `tbl_penjualan`.`id_penjualan`
JOIN `tbl_barang` ON `tbl_penjualan`.`id_barang` = `tbl_barang`.`id_barang`
---
    public function index()
    {
        $data = [
            'title' => 'Data Barang Keluar',
            'barang_keluar' => $this->barangKeluar
                ->select('tbl_barang_keluar.*, tbl_penjualan.*, tbl_barang.nama_barang') // Kolom tbl_barang.nama_barang yang benar
                ->join('tbl_penjualan', 'tbl_barang_keluar.id_penjualan = tbl_penjualan.id_penjualan') // Join dengan tbl_penjualan
                ->join('tbl_barang', 'tbl_penjualan.id_barang = tbl_barang.id_barang') // Join dengan tbl_barang
                ->findAll()