app/Controllers/Admin/BarangController.php

SELECT *
FROM `tbl_barang`
JOIN `tbl_supplier` ON `tbl_supplier`.`id_supplier` = `tbl_barang`.`id_supplier`
SELECT *
FROM `tbl_supplier`
---
    public function index()
    {
        $lastID = $this->barangModel->getLastID();
        if ($lastID == null) {
            $incrementId = 1; // Jika tidak ada ID sebelumnya, mulai dari 1
        } else {
            // Ambil bagian numerik dari ID
            $sliceId = substr($lastID, 4); // Mengambil karakter setelah "SUP-"

            // Pastikan bagian numerik diproses dengan benar
            $incrementId = intval($sliceId) + 1; // Konversi ke integer dan tambahkan 1
        }
        $id_barang = 'BRG-'.str_pad($incrementId, 3, '0', STR_PAD_LEFT);
        $data = [
            'title' => 'Data Barang',
            'data_barang' => $this->barangModel->join('tbl_supplier','tbl_supplier.id_supplier = tbl_barang.id_supplier')->findAll(),
            'data_supplier' => $this->supplierModel->findAll(),

INSERT INTO `tbl_barang` (`id_barang`, `nama_barang`, `stok`, `harga`, `id_supplier`) VALUES ('BRG-002', 'Semen Tiga Roda', '3', '200000', 'SUP-001')
---
    public function save(){
        $data = $this->request->getPost();
        if($this->barangModel->insert($data)==true){