app/Controllers/Admin/PenjualanController.php

    public function index()
    {
        $data = [
            'title' => 'Data Penjualan',
            'penjualan' => $this->penjualanModel->join('tbl_barang', 'tbl_barang.id_barang = tbl_penjualan.id_barang')->findAll(),
            'barang' => $this->barangModel->findAll(),
---
SELECT *
FROM `tbl_penjualan`
JOIN `tbl_barang` ON `tbl_barang`.`id_barang` = `tbl_penjualan`.`id_barang`
SELECT *
FROM `tbl_barang`

    public function save(){
        //Generate Penjualan ID
        $lastID = $this->penjualanModel->getLastID();
        if ($lastID == null) {
            $incrementId = 1; // Jika tidak ada ID sebelumnya, mulai dari 1
        } else {
            // Ambil bagian numerik dari ID
            $sliceId = substr($lastID, 4); // Mengambil karakter setelah "SUP-"

            // Pastikan bagian numerik diproses dengan benar
            $incrementId = intval($sliceId) + 1; // Konversi ke integer dan tambahkan 1
        }
        $idPenjualan = 'PJN-'.str_pad($incrementId, 3, '0', STR_PAD_LEFT);
        //Generate Barang Keluar ID
        $lastIDKeluar = $this->barangKeluar->getLastID();
        if ($lastIDKeluar == null) {
            $incrementIdKeluar = 1; // Jika tidak ada ID sebelumnya, mulai dari 1
        } else {
            // Ambil bagian numerik dari ID
            $sliceIdKeluar = substr($lastIDKeluar, 5); // Mengambil karakter setelah "SUP-"

            // Pastikan bagian numerik diproses dengan benar
            $incrementIdKeluar = intval($sliceIdKeluar) + 1; // Konversi ke integer dan tambahkan 1
        }
        $idKeluar = 'BRGK-'.str_pad($incrementIdKeluar, 3, '0', STR_PAD_LEFT);
        $data = $this->request->getPost();
        $dataBarang = $this->barangModel->find($data['id_barang']);
        $this->barangModel->update($data['id_barang'], ['stok' => $dataBarang['stok'] - $data['qty']]);
---
SELECT *
FROM `tbl_barang`
WHERE `tbl_barang`.`id_barang` = 'BRG-001'
UPDATE `tbl_barang` SET `stok` = 10
WHERE `tbl_barang`.`id_barang` IN ('BRG-001')

            'id_penjualan' => $idPenjualan,
            'tanggal_keluar' => date('Y-m-d'),
        ];
        $this->barangKeluar->insert($dataBarangKeluar);
---
INSERT INTO `tbl_barang_keluar` (`id_barang_keluar`, `id_penjualan`, `tanggal_keluar`) VALUES ('BRGK-001', 'PJN-001', '2024-11-20')

            'qty' => $data['qty'],
            'total' => $data['total']
        ];
        $this->penjualanModel->insert($dataPenjualan);
---
INSERT INTO `tbl_penjualan` (`id_penjualan`, `id_barang`, `qty`, `total`) VALUES ('PJN-001', 'BRG-001', '20', '40000')