app/Controllers/Admin/PesananController.php

    public function index()
    {
        $data = [
            'title' => 'Data Pesanan',
            'data_pesanan' => $this->pesananModel->join('tbl_supplier','tbl_supplier.id_supplier = tbl_pesanan.id_supplier')->findAll(),
            'barang_supplier' => $this->barangSupplier->findAll()
---
SELECT *
FROM `tbl_pesanan`
JOIN `tbl_supplier` ON `tbl_supplier`.`id_supplier` = `tbl_pesanan`.`id_supplier`
SELECT *
FROM `tbl_barang_supplier`