app/Controllers/Admin/UserController.php

    public function index()
    {
        $data = [
            'title' => 'Data User',
            'data_pengguna' => $this->userModel->findAll()
        ];
---
SELECT *
FROM `tbl_user`