app/Models/BarangKeluarModel.php

SELECT `id_barang_keluar`
FROM `tbl_barang_keluar`
ORDER BY `id_barang_keluar` DESC
 LIMIT 1
---
    public function getLastID(){
        $builder = $this->db->table('tbl_barang_keluar');
        $builder->select('id_barang_keluar');
        $builder->orderBy('id_barang_keluar', 'DESC');
        $builder->limit(1);
        $query = $builder->get();