app/Models/BarangModel.php

SELECT `id_barang`
FROM `tbl_barang`
ORDER BY `id_barang` DESC
 LIMIT 1
---
    public function getLastID(){
        $builder = $this->db->table('tbl_barang');
        $builder->select('id_barang');
        $builder->orderBy('id_barang', 'DESC');
        $builder->limit(1);
        $query = $builder->get();

SELECT *
FROM `tbl_barang`
WHERE `id_barang` = 'BRG-001'
 LIMIT 1
---
    public function getBarangById($id_barang)
    {
        return $this->where('id_barang', $id_barang)->first();