app/Models/PenjualanModel.php

    public function getLastID(){
        $builder = $this->db->table('tbl_penjualan');
        $builder->select('id_penjualan');
        $builder->orderBy('id_penjualan', 'DESC');
        $builder->limit(1);
        $query = $builder->get();
---
SELECT `id_penjualan`
FROM `tbl_penjualan`
ORDER BY `id_penjualan` DESC
 LIMIT 1